unit Font8x8;
{ Модуль содержит русский (+английский шрифт, потом) размером 8х8.
   Сделано в форме массива, каждая буква имеет символьное имя.
   Этот модуль не предназначен для компиляции в составе Font_Creator }

interface

const
   ru_BigA = 0;//А
   ru_BigB = 1;//Б
   ru_BigW = 2;//В
   ru_BigG = 3;//Г
   ru_BigD = 4;//Д
   ru_BigE = 5;//Е
   ru_BigE2 = 6;//Ё
   ru_BigZh = 7;//Ж
   ru_BigZ = 8;//З
   ru_BigI = 9;//И
   ru_BigJ = 10;//Й
   ru_BigK = 11;//К
   ru_BigL = 12;//Л
   ru_BigM = 13;//М
   ru_BigN = 14;//Н
   ru_BigO = 15;//О
   ru_BigP = 16;//П
   ru_BigR = 17;//Р
   rus_BigS = 18;//С
   rus_BigT = 19;//Т
   rus_BigU = 20;//У
   rus_BigF = 21;//Ф
   rus_BigKh = 22;//Х
   rus_BigTc = 23;//Ц
   rus_BigCh = 24;//Ч
   rus_BigSh = 25;//Ш
   rus_BigShh = 26;//Щ
   rus_BigHz = 27;//Ъ
   rus_BigSz = 28;//Ь
   space = 0;

var
   
   /// Шрифт 8х8
   f88: array[0..255, 0..7]of byte=(
      (0, 3, 5, 9, 17, 63, 65, 65),//ru_BigA
      (0, 126,64,126,65,65,65,126),//ru_BigB
      (0, 124,66,68,126,65,65,126),//ru_BigW
      (0, 127,65,64,64,64,64,64),//ru_BigG
      (0, 14,18,18,18,18,127,65),//ru_BigD
      (0, 127,64,124,64,64,64,127),//ru_BigE
      (0, 18,127,64,124,64,64,127),//ru_BigE2
      (0, 73,42,28,42,73,73,73),//ru_BigZh
      (0, 62,65,14,1,1,65,62),//ru_BigZ
      (0, 65,67,69,73,81,97,65),//ru_BigI
      (0, 67,76,112,72,68,66,65),//ru_BigK
      (0, 15,17,17,17,17,17,97),//ru_BigL
      (0, 65,99,99,85,85,73,73),//ru_BigM
      (0, 65,65,65,127,65,65,65),//ru_BigN
      (0, 62,65,65,65,65,65,62),//ru_BigO
      (0, 127,65,65,65,65,65,65),//ru_BigP
      (0, 126,65,65,65,126,64,64),//ru_BigR
      (0, 62,65,64,64,64,65,62),//ru_BigS
      (0, 127,8,8,8,8,8,8),//ru_BigT
      (0, 65,65,65,63,1,65,62),//ru_BigU
      (0, 62,73,73,73,73,62,8),//ru_BigF
      (0, 65,34,20,8,20,34,65),//ru_BigKh
      (0, 66,66,66,66,66,127,1),//ru_BigTc
      (0, 65,65,65,63,1,1,1),//rus_BigCh
      (0, 73,73,73,73,73,73,127),//rus_BigSh
      (0, 84,84,84,84,84,126,2),//rus_BigShh
      (0, 96,32,32,62,33,33,62),//rus_BigHz
      (0, 64,64,64,126,65,65,126),//rus_BigSz
      
      (0, 0, 0, 0, 0, 0, 0, 0),//space
      
      ;

implementation

begin
   f88[space] := 
   f88[rus_BigA] :=
end.